# AnalyticalMemberSectionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalMemberSectionType Property
ParameterTypeId Class See Also
---
"Section Type": The id of the type from the structural Family assigned to the analytical member.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalMemberSectionType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalMemberSectionType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalMemberSectionType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace